{
  "projects": [
    {
      "title": "Invasikode",
      "tag": [
        "Design",
        "Development",
        "Writing"
      ],
      "link": "https://www.invasikode.com",
      "description": "My own blogging website, incorporating both Vue and Nuxt for the full stack. It features my writing on programming and tech related topics with over 1K visitors per week.",
      "previews": []
    },
    {
      "title": "Hnome",
      "tag": [
        "Design",
        "Development",
        "WIP"
      ],
      "link": "#",
      "description": "I built my own homepage for my browser, because why the heck not! It's not the most exciting looking thing, but it gave me the opportunity to play around with Svelte.",
      "previews": []
    },
    {
      "title": "Sifana",
      "tag": [
        "Design",
        "Development"
      ],
      "link": "https://www.sifana.id",
      "description": "I worked on my first client project and built a landing page for a printing company. I did the design and deployment too. And let's just say, it felt pretty good to get paid for it.",
      "previews": []
    },
    {
      "title": "ERGEBE",
      "tag": [
        "Development"
      ],
      "link": "https://ergebe.netlify.app",
      "description": "First time doing volunteer work with a team to help out coffee farmers. Built a page to show and monitor a coffee sorting machine. It's all for a good cause.",
      "previews": []
    }
  ],
  "writings": [
    {
      "title": "What's Up Javascript? SoJS 2022",
      "leading": "Invasikode (id-ID)",
      "link": "https://www.invasikode.com/apa-kabar-javascript-rilis-state-of-js-2022",
      "description": "40k people took the 2022 State of JS survey and it's gonna be a blast to go through. Here's a quick rundown of what's up with JavaScript this year, based on the survey results."
    },
    {
      "title": "React, Vue, Angular, what to Decide?",
      "leading": "Invasikode (id-ID)",
      "link": "https://www.invasikode.com/react-angular-vue-pilih-framework-yang-mana",
      "description": "Explore the pros and cons of Vue, Angular, and React in this article, helping you make an informed decision on which JavaScript framework to use for your next project."
    },
    {
      "title": "Guide: Using Node and Express with TS",
      "leading": "Invasikode (id-ID)",
      "link": "https://www.invasikode.com/menggunakan-typescript-dengan-node-js-dan-express",
      "description": "Learn how to set up a Node.js and Express server with TypeScript in this step-by-step guide, providing a solid foundation for your next web development project."
    },
    {
      "title": "Make CMD-ing Fun Again with Starship",
      "leading": "Invasikode (id-ID)",
      "link": "https://www.invasikode.com/buat-powershell-lebih-berwarna-dengan-starship",
      "description": "Simplify your command line experience with this guide on setting up the Starship prompt for PowerShell. Make CMD-ing more fun with colorful terminal in Windows Powershell"
    }
  ]
}